#1. Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет) и метод running (запуск).
#Атрибут реализовать как приватный.
#В рамках метода реализовать переключение светофора в режимы: красный, желтый, зеленый.
#Продолжительность первого состояния (красный)составляет 7 секунд, второго (желтый) — 2 секунды,третьего (зеленый) — на ваше усмотрение.
#Переключение между режимами должно осуществляться только в указанном порядке (красный, желтый, зеленый).
#Проверить работу примера, создав экземпляр и вызвавописанный метод.

from time import sleep
class TrafficLight:
    __color = ['Красный', 'Желтый', 'Зеленый']
    def work(self):
        while True:
            i = 0
            for i in range(0, 3):
                print(f'{TrafficLight.__color[i]}')
                if i == 0:
                    sleep(7)
                elif i == 1:
                    sleep(5)
                elif i == 2:
                    sleep(9)
                i += 1
trafficLight = TrafficLight()
trafficLight.work()